app/Controllers/Article.php

    public function view($id)
    {
        $categoryModel = new CategoryModel();
        $data["category"] = $categoryModel->findAll();
        $modelArticle = new ArticleModel();
        $data["title"] = $modelArticle->select('title')->find($id)['title'] ?? null;
        $data["news5Popular"] = $modelArticle->getArticle5Popular();
        $data["detail"] = $modelArticle->getDetailArticle($id);

        $modelComment = new CommentModel();
        $data["comment"] = $modelComment->orderBy("id","DESC")->where("id_article",$id)->findAll(6);

        $ip = $this->request->getIPAddress();
        $modelViews = new ViewsModel();


        // Cek apakah IP sudah view artikel ini hari ini
        $alreadyViewed = $modelViews->where([
            'visitor_ip' => $ip,
            'id_article' => $id,
            'date_views' => date('Y-m-d'),
        ])->first();

        if (!empty($id) && is_numeric($id) && !$alreadyViewed) {
            $modelViews->save([
                "date_views" => date("Y-m-d"),
                "visitor_ip" => $ip,
                "id_article" => $id,
            ]);
---
SELECT *
FROM `category`
SELECT `title`
FROM `articles`
WHERE `articles`.`id` = '9'
SELECT *
FROM `comments`
WHERE `id_article` = '9'
ORDER BY `id` DESC
 LIMIT 6
SELECT *
FROM `views`
WHERE `visitor_ip` = '::1'
AND `id_article` = '9'
AND `date_views` = '2025-07-07'
 LIMIT 1
INSERT INTO `views` (`date_views`, `visitor_ip`, `id_article`) VALUES ('2025-07-07', '::1', '9')

    public function category($category)
    {
        $categoryModel = new CategoryModel();
        $data["category"] = $categoryModel->findAll();
        $data["category_name"] = $categoryModel->find($category);
---
SELECT *
FROM `category`
SELECT *
FROM `category`
WHERE `category`.`id` = '1'