app/Models/ArticleModel.php

SELECT `articles`.*, `category`.`category`
FROM `articles`
JOIN `category` ON `category`.`id` = `articles`.`id_category`
ORDER BY `articles`.`id` DESC
 LIMIT 4
---
    public function getArticleWithCategory($limit = 0, $order = "DESC")
    {
        $query = $this->select('articles.*, category.category')
                  ->join('category', 'category.id = articles.id_category')
                  ->orderBy('articles.id',$order);

        if (!empty($limit) && is_numeric($limit) && $limit > 0) {
            return $query->findAll($limit);

SELECT `articles`.*, COUNT(DISTINCT views.id) AS total_views, COUNT(DISTINCT comments.id) AS total_comments, COUNT(DISTINCT likes.id) AS total_likes
FROM `articles`
LEFT JOIN `views` ON `views`.`id_article` = `articles`.`id`
LEFT JOIN `comments` ON `comments`.`id_article` = `articles`.`id`
LEFT JOIN `likes` ON `likes`.`id_article` = `articles`.`id`
WHERE `articles`.`content` != ""
GROUP BY `articles`.`id`
ORDER BY `id` DESC
 LIMIT 1
---
    public function getArticlePopular()
    {
        $query = $this->select('
            articles.*,
            COUNT(DISTINCT views.id) AS total_views,
            COUNT(DISTINCT comments.id) AS total_comments,
            COUNT(DISTINCT likes.id) AS total_likes
        ')
        ->join('views', 'views.id_article = articles.id', 'left')
        ->join('comments', 'comments.id_article = articles.id', 'left')
        ->join('likes', 'likes.id_article = articles.id', 'left')
        ->groupBy('articles.id')
        ->where('articles.content != ""')
        ->orderBy('id', 'DESC');

        return $query->first();

SELECT `articles`.*, COUNT(DISTINCT views.id) AS total_views, COUNT(DISTINCT comments.id) AS total_comments, COUNT(DISTINCT likes.id) AS total_likes
FROM `articles`
LEFT JOIN `views` ON `views`.`id_article` = `articles`.`id`
LEFT JOIN `comments` ON `comments`.`id_article` = `articles`.`id`
LEFT JOIN `likes` ON `likes`.`id_article` = `articles`.`id`
WHERE `articles`.`content` != ""
GROUP BY `articles`.`id`
ORDER BY `total_views` DESC
 LIMIT 7
---
    public function getArticle7Popular()
    {
        $query = $this->select('
            articles.*,
            COUNT(DISTINCT views.id) AS total_views,
            COUNT(DISTINCT comments.id) AS total_comments,
            COUNT(DISTINCT likes.id) AS total_likes
        ')
        ->join('views', 'views.id_article = articles.id', 'left')
        ->join('comments', 'comments.id_article = articles.id', 'left')
        ->join('likes', 'likes.id_article = articles.id', 'left')
        ->groupBy('articles.id')
        ->where('articles.content != ""')
        ->orderBy('total_views', 'DESC');

        return $query->findAll(7);

SELECT `articles`.*, `category`.`category`, COUNT(DISTINCT comments.id) AS total_comments, COUNT(DISTINCT likes.id) AS total_likes
FROM `articles`
LEFT JOIN `category` ON `category`.`id` = `articles`.`id_category`
LEFT JOIN `comments` ON `comments`.`id_article` = `articles`.`id`
LEFT JOIN `likes` ON `likes`.`id_article` = `articles`.`id`
WHERE `articles`.`content` != ""
GROUP BY `articles`.`id`
ORDER BY `total_likes` DESC, `total_comments` DESC
 LIMIT 7
---
    public function getArticle5Popular()
    {
        $query = $this->select('
            articles.*,
            category.category,
            COUNT(DISTINCT comments.id) AS total_comments,
            COUNT(DISTINCT likes.id) AS total_likes
        ')
        ->join('category', 'category.id = articles.id_category', 'left')
        ->join('comments', 'comments.id_article = articles.id', 'left')
        ->join('likes', 'likes.id_article = articles.id', 'left')
        ->groupBy('articles.id')
        ->where('articles.content != ""')
        ->orderBy('total_likes,total_comments', 'DESC');

        return $query->findAll(7);

SELECT `articles`.*, `category`.`category`, COUNT(DISTINCT views.id) AS total_views, COUNT(DISTINCT comments.id) AS total_comments, COUNT(DISTINCT likes.id) AS total_likes, COUNT(DISTINCT shares.id) AS total_shares
FROM `articles`
LEFT JOIN `category` ON `category`.`id` = `articles`.`id_category`
LEFT JOIN `views` ON `views`.`id_article` = `articles`.`id`
LEFT JOIN `comments` ON `comments`.`id_article` = `articles`.`id`
LEFT JOIN `likes` ON `likes`.`id_article` = `articles`.`id`
LEFT JOIN `shares` ON `shares`.`id_article` = `articles`.`id`
WHERE `articles`.`content` != ""
GROUP BY `articles`.`id`
ORDER BY `created_at` DESC
 LIMIT 30
---
    public function getCategoryWithArticle()
    {
        $query = $this->select('
            articles.*,
            category.category,
            COUNT(DISTINCT views.id) AS total_views,
            COUNT(DISTINCT comments.id) AS total_comments,
            COUNT(DISTINCT likes.id) AS total_likes,
            COUNT(DISTINCT shares.id) AS total_shares,
        ')
        ->join('category', 'category.id = articles.id_category', 'left')
        ->join('views', 'views.id_article = articles.id', 'left')
        ->join('comments', 'comments.id_article = articles.id', 'left')
        ->join('likes', 'likes.id_article = articles.id', 'left')
        ->join('shares', 'shares.id_article = articles.id', 'left')
        ->groupBy('articles.id')
        ->where('articles.content != ""')
        ->orderBy('created_at', 'DESC');

        return $query->findAll(30);

SELECT `articles`.*, `category`.`category`, COUNT(DISTINCT views.id) AS total_views, COUNT(DISTINCT comments.id) AS total_comments, COUNT(DISTINCT likes.id) AS total_likes, COUNT(DISTINCT shares.id) AS total_shares
FROM `articles`
LEFT JOIN `category` ON `category`.`id` = `articles`.`id_category`
LEFT JOIN `views` ON `views`.`id_article` = `articles`.`id`
LEFT JOIN `comments` ON `comments`.`id_article` = `articles`.`id`
LEFT JOIN `likes` ON `likes`.`id_article` = `articles`.`id`
LEFT JOIN `shares` ON `shares`.`id_article` = `articles`.`id`
WHERE `articles`.`content` != ""
AND `articles`.`id` = '9'
GROUP BY `articles`.`id`
ORDER BY `created_at` DESC
---
    public function getDetailArticle($id)
    {
        $query = $this->select('
            articles.*,
            category.category,
            COUNT(DISTINCT views.id) AS total_views,
            COUNT(DISTINCT comments.id) AS total_comments,
            COUNT(DISTINCT likes.id) AS total_likes,
            COUNT(DISTINCT shares.id) AS total_shares,
        ')
        ->join('category', 'category.id = articles.id_category', 'left')
        ->join('views', 'views.id_article = articles.id', 'left')
        ->join('comments', 'comments.id_article = articles.id', 'left')
        ->join('likes', 'likes.id_article = articles.id', 'left')
        ->join('shares', 'shares.id_article = articles.id', 'left')
        ->groupBy('articles.id')
        ->where('articles.content != ""')
        ->orderBy('created_at', 'DESC');

        return $query->find($id);